ms-python.python
ms-python.pylance
ms-python.debugpy
ecmel.vscode-html-css
wholroyd.jinja
formulahendry.auto-rename-tag
esbenp.prettier-vscode
ms-python.black-formatter
cstrap.flask-snippets
ritwickdey.liveserver
usernamehw.errorlens
christian-kohler.path-intellisense